import React from 'react';
import './SingleItem.css';

export default function SingleItem() {
    return (
        <>
            <div>
                <div>
                    Medicine
                </div>
                <div>
                    هدف صيدلية فيزيتا الرئيسي هو حصول العملاء علي المعلومات الدقيقة و الموثوق بها. جميع المعلومات المعروضة هنا منقولة من النشرة الخاصة بالدواء و يكون مصنع الدواء وحده مسئولا عن دقتها. و بناء عليه يرجي استشارة طبيبك و مناقشة كافة الاستفسارات المتعلقة بأي مرض او دواء. نحن نهدف الي المساعدة و ليس استبدال علاقة الطبيب بالمريض
                    صيدلية فيزيتا هي شركة إدارة صيدليات مسجلة قانونًا وهي مصممة فقط لإدارة الصيدليات المرخصة داخل جمهورية مصر العربية.يتم الحصول على 100٪ من أدويتنا وتوزيعها من الصيدليات المرخصة وفقًا للوائح وزارة الصحة والسكان المصرية.نحن لا ولن نقوم بتوزيع الأدوية من المخازن. كما اننا ملتزمون وسنواصل الالتزام بالقانون و ذلك بخصوص الحصول على الأدوية من الصيدليات المرخصة.جميع مواقع الصيدليات الخاصة بنا متاحة على الإنترنت ، وكلها مملوكة ومدارة من قبل صيادلة مرخصين داخل جمهورية مصر العربية. كما ان جميع الفواتير صادرة من قبل صيدليات مرخصة داخل جمهورية مصر العربية
                </div>
            </div>
            <p>
            </p>
        </>
    )
}
