import React from 'react';
import style from './Data.module.css'
export default function DataComponent() {
    return <>
    <div className={`row justify-content-center ${style.content}`}>
        <div class="col-md-8 col-12">
            <h5>برجاء العلم:</h5>
            <ul>
                <li>
                    فيزيتا ليست منشأة طبية و أنما هي وسيط بين مقدمي
                    الخدمة الصحية المرخصين و 
                    المرضي عن طريق موقعها الإلكتروني / تطبيقات الهاتف.
                </li>
                <li>
                    لا تحل فيزيتا محل علاقة طبيب الرعاية الأولية الموجودة.
                </li>
                <li>
                    تخضع الخدمات الطبية التي يقدمها مقدمي الخدمات الصحية لحكمهم المهني.
                </li>
                <li>لا تضمن فيزيتا كتابة وصفة طبية.</li>
                <li>
                    لا يصف الأطباء و مقدمي الخدمات المواد الخاضعة للتحكم
                    و الأدوية المدرجة علي الجداول المخدرة والأدوية غير العلاجية وبعض الأدوية
                    الأخرى التي قد تكون ضارة بسبب احتمال إساءة استخدامها.
                </li>
                <li>
                    جميع البيانات التي يتم جمعها من المرضي يتم إستخدامها وفقاً لقوانين و اللوائح بجمهرية مصر العربية
                </li>
            </ul>
        </div>
    </div>
    </>;
}
